INSTALLER_APPLICATION_NAME = "LOGITECH G HUB";
INSTALLER_GENERIC_TRY_AGAIN = "YRITÄ UUDELLEEN";
INSTALLER_GENERIC_CONTINUE = "JATKA";
INSTALLER_GENERIC_CANCEL = "PERUUTA";
INSTALLER_GENERIC_BACK = "TAKANA";
INSTALLER_GENERIC_REINSTALL = "ASENNA UUDELLEEN";
INSTALLER_GENERIC_LAUNCH_GHUB = "KÄYNNISTÄ";
INSTALLER_GENERIC_UNINSTALL = "POISTA ASENNUS";
INSTALLER_GENERIC_LETS_PARTY = "BILEET PYSTYYN";
INSTALLER_GENERIC_QUIT = "LOPETA";
INSTALLER_GENERIC_REBOOT_NOW = "KÄYNNISTÄ UUDELLEEN NYT";
INSTALLER_GENERIC_REBOOT_LATER = "KÄYNNISTÄ UUDELLEEN MYÖHEMMIN";
INSTALLER_ONLINE_HELP = "VERKKO-OHJE";
INSTALLER_MORE_DETAILS = "Lisätietoja";
INSTALLER_HELP_LINK = "https://support.logi.com/hc/articles/360023192454";
INSTALLER_DISK_INDICATOR_NORMAL = "{0} Gt vapaana asemalla {1}";
INSTALLER_DISK_INDICATOR_WARNING = "Alle 1 Gt vapaana asemalla {0}";
INSTALLER_DISK_INDICATOR_ERROR = "Alle 500 Gt vapaana asemalla {0}";
INSTALLER_ERROR_DOWNLOAD_INIT = "Latauksen aloittaminen epäonnistui verkko-ongelman takia. Yritä uudelleen.";
INSTALLER_ERROR_NETWORK_ISSUE = "Lataus epäonnistui verkko-ongelman takia. Yritä uudelleen.";
INSTALLER_ERROR_UPDATE_SUMMARY = "Kelvollista päivitysyhteenvetoa ei saatu. Yritä uudelleen.";
INSTALLER_ERROR_DISK_FULL = "Vapaa levytila ei riitä.";
INSTALLER_ERROR_UNCAUGHT_ERROR = "Asennuksen aikana ilmeni virhe. Yritä uudelleen.";
INSTALLER_ERROR_UNPACKING = "Asennusohjelman resurssien purkaminen epäonnistui. Asennusohjelman käynnistäminen uudelleen voi ratkaista ongelman.";
INSTALLER_ERROR_DLL_LOADING = "Asennusohjelman tärkeitä komponentteja ei voitu ladata.";
INSTALLER_ERROR_START_INSTALL = "Asennuksen aloittaminen epäonnistui. Asennusohjelman sulkeminen ja käynnistäminen uudelleen voi ratkaista ongelman.";
INSTALLER_ERROR_REDOWNLOAD = "Lataa se uudelleen ";
INSTALLER_ERROR_OS_VERSION = "G HUB ei ole yhteensopiva nykyisen käyttöjärjestelmäsi kanssa. Tarkista G HUBIN käyttöjärjestelmäyhteensopivuus saadaksesi lisätietoja.";
INSTALLER_ERROR_UPDATER_FOLDER = "Asennuskansion luominen ei onnistu. ";
INSTALLER_ERROR_INSTALL_FAILED_GENERIC_TITLE = "G HUBIN asennus ei onnistunut";
INSTALLER_ERROR_INSTALL_FAILED_GENERIC = "Käynnistä tietokone uudelleen, ennen kuin yrität asentaa sitä uudelleen. Jos ongelma jatkuu, ota yhteyttä {WEBSITE}.";
INSTALLER_ERROR_INSTALL_FAILED_GENERIC_WEBSITE_TEXT = "asiakastukeen";
INSTALLER_ERROR_INSTALL_FAILED_GENERIC_WEBSITE_LINK = "support.logitech.com";
INSTALLER_OFFICIAL_WEBSITE = "VIRALLISELTA VERKKOSIVUSTOLTA.";
INSTALLER_INFO_VERSION = "VERSIO {0}";
INSTALLER_INFO_DESTINATION = "Asennetaan kohteeseen {0}";
INSTALLER_INFO_DOWNLOAD_PROGRESS = "{0} Mt / {1} Mt ({2} Mt/s)";
INSTALLER_LOADING_MESSAGE_0 = "Lataus edistyy hitaasti";
INSTALLER_LOADING_MESSAGE_1 = "Voiko lataus odottaa? Suoritamme parhaillaan kalibrointia";
INSTALLER_LOADING_MESSAGE_2 = "Varmistetaan, että tulostin ja incognito-historia on yhdistetty kunnolla";
INSTALLER_LOADING_MESSAGE_3 = "Reaktoritehoa ohjataan muualle";
INSTALLER_LOADING_MESSAGE_4 = "Nyan-kissaa kutsutaan";
INSTALLER_LOADING_MESSAGE_5 = "Tarvitset lisää vespene-kaasua.";
INSTALLER_LOADING_MESSAGE_6 = "En minä tee mitään epäilyttävää. Ihan tosi!";
INSTALLER_LOADING_MESSAGE_7 = "Tesselloidaan äärettömyysmatriisia";
INSTALLER_LOADING_MESSAGE_8 = "Sinun on rakennettava lisää pyloneja";
INSTALLER_LOADING_MESSAGE_9 = "Vitamin D on välttämätöntä ihmiskeholle";
INSTALLER_LOADING_MESSAGE_10 = "Frame Shift Drive käytössä";
INSTALLER_LOADING_MESSAGE_11 = "Parempi hiiri kädessä kuin kymmenen oksalla";
INSTALLER_LOADING_MESSAGE_12 = "Aika rientää, kun on hauskaa";
INSTALLER_LOADING_MESSAGE_13 = "Hankkiudutaan turhasta eroon";
INSTALLER_LOADING_MESSAGE_14 = "Väliaikaista kaikki on vain";
INSTALLER_LOADING_MESSAGE_15 = "Vedetään housuja jalkaan";
INSTALLER_LOADING_MESSAGE_16 = "Lähetetään parasta soturiamme";
INSTALLER_LOADING_MESSAGE_17 = "Syaani näyttää epäilyttävältä...";
INSTALLER_LOADING_MESSAGE_18 = "Retikuloidaan splinejä";
INSTALLER_LOADING_MESSAGE_19 = "Toteutetaan maailmanvalloitussuunnitelmaa";
INSTALLER_LOADING_MESSAGE_20 = "Mitä tästä nappulasta tapahtuu?";
INSTALLER_LOADING_MESSAGE_21 = "Hei. Olet vihdoin herännyt";
INSTALLER_MESSAGEBOX_TITLE = "G HUBin asennusohjelma";
INSTALLER_MESSAGEBOX_FOLDER_MESSAGE = "Kriittinen virhe: Asennuksen tarvitsemia kansioita ei voida luoda. Yritä uudelleen järjestelmänvalvojana. Jos ongelma ei ratkea, ota yhteyttä osoitteeseen https://support.logi.com/hc";
INSTALLER_MODAL_REBOOT = "Tietokone on käynnistettävä uudelleen edellytysten asennuksen viimeistelemiseksi. Asennusohjelma käynnistyy uudelleen, kun tietokone on käynnistetty uudelleen.";
INSTALLER_MODAL_TITLE_FAILED = "Asennus epäonnistui.";
INSTALLER_MODAL_TITLE_INIT_FAILED = "Alustus epäonnistui.";
INSTALLER_MODAL_TITLE_EXITING_SW = "Asennus on jo tehty.";
INSTALLER_MODAL_TITLE_CONFIRM = "Asennetaanko G HUB uudelleen?";
INSTALLER_MODAL_TITLE_UNINSTALL = "Poistetaan asennusta.";
INSTALLER_MODAL_TITLE_UNINSTALL_SUCCESS = "Asennus poistettiin.";
INSTALLER_MODAL_TITLE_UNINSTALL_FAILURE = "Virhe poistettaessa asennusta.";
INSTALLER_MODAL_TITLE_EXIT = "Lopeta asennus.";
INSTALLER_MODAL_TITLE_REBOOT = "Tarvitaan uudelleenkäynnistys.";
INSTALLER_MODAL_TITLE_UPDATE_ERROR = "Päivitysvirhe.";
INSTALLER_MODAL_CONFIRM_EXIT = "Haluatko varmasti lopettaa?";
INSTALLER_OFFICIAL_WEBSITE_LINK = "https://www.logitechg.com/ghub";
INSTALLER_STEP_INITIALIZE = "Alustetaan";
INSTALLER_STEP_UNPACK = "Puretaan";
INSTALLER_STEP_INSTALLING = "Asennetaan";
INSTALLER_STEP_FINALIZING = "Viimeistellään";
INSTALLER_TERMS_OF_SERVICE_AGREEMENT_TEXT = "Napsauttamalla Asenna hyväksyt ";
INSTALLER_TERMS_OF_SERVICE_AGREEMENT_LINK_TEXT = "KÄYTTÖOIKEUSSOPIMUKSEN.";
INSTALLER_TERMS_OF_SERVICE_AGREEMENT_LINK = "https://www.logitech.com/legal/eula.html";
INSTALLER_TOOLTIP_INSTALL = "Odota, että G HUB asennetaan.";
INSTALLER_TOOLTIP_UPDATE = "Odota, että G HUB päivitetään.";
INSTALLER_APPLICATION_TITLE = "Logitech G HUB -asennusohjelma";
INSTALLER_WINDOW_TITLE = "{0} G HUBin asennusohjelma";
INSTALLER_APPLICATION_DESCRIPTION = "Logitech G HUB -asennussovellus";
INSTALLER_INSTALL_BUTTON = "ASENNA";
INSTALLER_INSTALL_WITH_ENTER_BUTTON = "ASENNA (ENTER/RETURN)";
INSTALLER_GET_UPDATE_BUTTON = "HANKI PÄIVITYS";
INSTALLER_EXIT_BUTTON = "POISTU";
INSTALLER_CANCEL_BUTTON = "PERUUTA";
INSTALLER_DESCRIPTION_ALREADY_INSTALLED = "Ohjelmisto on jo järjestelmässä. Käynnistä G HUB etsiäksesi päivityksiä.";
INSTALLER_DESCRIPTION_LEGACY_INSTALLED = "Järjestelmässä on Logitech Gaming Softwaren vanhentunut ja epäyhteensopiva versio. Päivitä tai poista se, jos haluat asentaa G HUBin.";
INSTALLER_HEADER_DOWNLOADING = "LADATAAN LOGITECH G HUB";
INSTALLER_DESCRIPTION_DOWNLOADING = "Uusi Logitech G HUB -ohjelmisto parantaa juuri pelaamis- ja laitekokoonpanokokemustasi…";
INSTALLER_DESCRIPTION_DOWNLOADING_1 = "…rakentaminen ja suojelu…";
INSTALLER_DESCRIPTION_DOWNLOADING_2 = "…streiffataan ja buustataan…";
INSTALLER_DESCRIPTION_DOWNLOADING_3 = "…leijuminen ja laskeutuminen…";
INSTALLER_HEADER_DOWNLOADED = "LATAUS ONNISTUI";
INSTALLER_DESCRIPTION_DOWNLOADED = "Ladattu ja valmis.";
INSTALLER_INSTALL_AND_LAUNCH_BUTTON = "ASENNA JA KÄYNNISTÄ";
INSTALLER_MENU_ABOUT = "Tietoja";
INSTALLER_MENU_QUIT = "Lopeta";
INSTALLER_MENU_CLOSE = "Sulje ikkuna";
INSTALLER_TRANSFER_REMAINING = "jäljellä";
INSTALLER_ERROR_GENERIC = "Asennuksen aikana tapahtui virhe";
INSTALLER_FAILURE_PREFIX = "Lataus ei onnistunut:";
INSTALLER_ERROR_SUMMARY = "Kelvollista päivitysyhteenvetoa ei saatu.";
INSTALLER_ERROR_INITIALIZE = "Lataus ei onnistunut: Alustus epäonnistui. Tarkista verkkoyhteys ja yritä uudelleen.";
INSTALLER_ERROR_TIMEOUT = "Lataus ei onnistunut: Tarkista verkkoyhteys.";
INSTALLER_ERROR_WRITE = "Levy vaikuttaa olevan täynnä.";
INSTALLER_ERROR_DLL = "Asennusohjelman tärkeitä komponentteja ei voitu ladata. Lataa asennusohjelma uudelleen viralliselta verkkosivustolta.";
INSTALLER_RETRY_COUNTDOWN = "Yritetään uudestaan %d kuluttua.";
INSTALLER_UNCOMPRESSING = "Tiedostojen purkaminen";
